IDEA Open Model
CrossSectionFactory.FillWelded2Lt Method
Compatible with IDEA StatiCa 20.1
 Fill steel section Lt shape
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public static void FillWelded2Lt(
	CrossSectionParameter cssO,
	string name,
	double Distance
)
Public Shared Sub FillWelded2Lt (
	cssO As CrossSectionParameter,
	name As String,
	Distance As Double
)
Parameters
cssO
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
name
Type: System.String
Name
Distance
Type: System.Double
Distance
Return Value
Type:
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace